ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_mem_cfg_regs.xml
	<register id="MSGxINIT" width="32" page="1" offset="0x72" internal="0" description="Message RAM Init Register">
		<bitfield id="INIT_CPUTOCLA1" description="Initialization control for CPUTOCLA1 MSG RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CLA1TOCPU" description="Initialization control for CLA1TOCPU MSG RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_CLA1TODMA" description="Initialization control for CLA1 to DMA MSG RAM" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_DMATOCLA1" description="Initialization control for DMA to CLA1 MSG RAM" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="MSGxINITDONE" width="32" page="1" offset="0x74" internal="0" description="Message RAM InitDone Status Register">
		<bitfield id="INITDONE_CPUTOCLA1" description="Initialization status for CPU to CLA1 MSG RAM" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CLA1TOCPU" description="Initialization status for CLA1 to CPU MSG RAM" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_CLA1TODMA" description="Initialization status for CLA1 to DMA MSG RAM" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_DMATOCLA1" description="Initialization status for DMA to CLA1 MSG RAM" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="MSGxRAMTEST_LOCK" width="32" page="1" offset="0x76" internal="0" description="Lock register for MSGx RAM TEST Register">
		<bitfield id="CPUTOCLA1" description="MSGxRAMTEST_LOCK.CPUTOCLA1Lock Configuration" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLA1TOCPU" description="MSGxRAMTEST_LOCK.CLA1TOCPULock Configuration" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLA1TODMA" description="MSGxRAMTEST_LOCK.CLA1TODMALock Configuration" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DMATOCLA1" description="MSGxRAMTEST_LOCK.DMATOCLA1Lock Configuration" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable write to lock" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_LOCK" width="32" page="1" offset="0xa0" internal="0" description="ROM Config Lock Register">
		<bitfield id="LOCK_BOOTROM" description="BOOTROM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_SECUREROM" description="SECUREROM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLADATAROM" description="CLADATAROM Lock bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for writing ROM LOCK" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_TEST" width="32" page="1" offset="0xa2" internal="0" description="ROM  TEST Register">
		<bitfield id="TEST_BOOTROM" description="Selects the different modes for BOOTROM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_SECUREROM" description="Selects the different modes for SECUREROM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_CLADATAROM" description="Selects the different modes for CLADATAROM" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ROM_FORCE_ERROR" width="32" page="1" offset="0xa4" internal="0" description="ROM Force Error register">
		<bitfield id="FORCE_BOOTROM_ERROR" description="Force Bootrom Parity Error" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_SECUREROM_ERROR" description="Force SECUREROM Parity Error" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_CLADATAROM_ERROR" description="Force CLADATAROM Parity Error" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
</module>
